/******************************************************************************

                  版权所有 (C), 2017-2017, chandler

 ******************************************************************************
  文 件 名   : server.h
  版 本 号   : 初稿
  作    者   : chandler
  生成日期   : 2018年5月6日
  最近修改   :
  功能描述   : server.c 的头文件
  函数列表   :
*
*
#ifndef __SERVER_H__
  修改历史   :
  1.日    期   : 2018年5月6日
    作    者   : chandler
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#define __SERVER_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*==============================================*
 *      include header files                    *
 *----------------------------------------------*/




/*==============================================*
 *      constants or macros define              *
 *----------------------------------------------*/


/*==============================================*
 *      project-wide global variables           *
 *----------------------------------------------*/



/*==============================================*
 *      routines' or functions' implementations *
 *----------------------------------------------*/

extern static int SRV_accpet_process( int srvfd );
extern int SRV_creat_proc_server( const char *ip, int port );
extern void SRV_handle_client( int srvfd );
extern int  SRV_init( );
extern static int SRV_msg_process( int fd, char *buf,struct epoll_event *event);
extern static void SRV_recv_msg(int readfd,struct epoll_event *event);
extern void SRV_release( void );
extern static void SRV_write_msg(int writefd,struct epoll_event *event,int cnt);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __SERVER_H__ */
